---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumColorTemperature
source: html/725e0c54-4a67-ade3-856a-2ca72ea190ec.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumColorTemperature Property

The property labeled "Color Temperature" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericSelfIllumColorTemperature { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".